* Bacapup
is a bac addon

[[https://discord.com/channels/419383460600348673/1366124720306786406][Discord thread]], [[https://github.com/p1k0chu/BACAP-Unlocked-Potential][Github repository]]

** Advancements to do [28/43]
Advancements that will be added.

*** TODO Bedrock advancements

**** TODO Time for Stew - Give someone a suspicious stew.

**** TODO Smelt Everything - Connect 3 Chests to a single Furnace using 3 Hoppers.

**** TODO Freight Station - Use a Hopper to move an item from a Chest Minecart to a Chest.

**** TODO Super Sonic
Use Elytra to fly through a 1 by 1 gap while moving faster than 40 m/s

***** TODO RENAME SUPER SONIC

**** TODO Inception
Push a piston with a piston, then pull the original piston with that
piston.

***** TODO RENAME INCEPTION

**** TODO Map Room
Place 9 fully explored, adjacent map items into 9 item frames in a 3
by 3 square.

***** TODO RENAME MAP

*** TODO maxing out the amount of banners renderable on a map.
(40 or 400) banner markers. [[https://discord.com/channels/419383460600348673/738946989726760980/1471863779347402946][Discord]]

*** TODO You Know This Game Has Open World, Right?
stay in one chunk for a full duration

**** TODO come up with duration

*** TODO Shoulder pals
Travel 100 blocks with two parrot on your shoulders.
by Redpid42

*** TODO Use 5 totems within 10 seconds

*** TODO use every fuel in a furnace

*** TODO I Am Speed
travel 1,000 blocks in a boat on blue ice in the Nether
by xMrPolx

*** TODO Creativity Is All I Need
Use every banner pattern on one banner.
(Building, after "Fuit of the Looms")
by xMrPolx

*** TODO Dehydration
Dry a sponge in a furnace, but not without taking the water back.
by xMrPolx

*** TODO Justice but its an anvil

*** TODO Speedunning riddle by rounduction
[[https://discord.com/channels/419383460600348673/738946989726760980/1407768557881786409][Discord]]
[[https://discord.com/channels/419383460600348673/1366124720306786406/1479883728963764274][honestlytzadok's rhymed version]]

1. the first is to find a buried treasure without a map

   (open a bt without a map duh)
2. the second is to build a portal using a bucket

   TODO what exactly does this require?
3. the third is to trade with piglins while in a bastion
4. the fourth is to pearl to a nether fortress
5. the fifth is to leave on six rods

   enter nether portal thats inside of fortress, while you have at
   least 6 rods
6. the sixth is to measure your eyes

   (enter + leave a boat, do not move and throw a pearl, and look at it)
7. the seventh is to ice pie

   enter a nether portal that leads straight into a stronghold
8. the eight is to die

   die or (in hardcore) take damage from a pearl while your bed is set
   and next to you
9. the ninth is post tree tree farm

   literally build post tree tree farm. tip: the tree farm must be
   post tree.
10. the tenth, if you can achieve this, you will be +yo im feinberg yo
    im feinberg yo im feinberg yo im feinberg yo im feinberg+ the goat

    paper says: do a zero cycle

    actually: detect real zero cycle (if dragon never perches and dies =
    technically zero cycles??)

*** TODO HELP ME - block 10 hits from a baby zombie in a row while on low health

*** TODO mine 64 gravel without getting a single flint
silk touch makes this easy obv

possibly add version forcing to not use silk touch, but less than 64

*** TODO polyglot - own a parrot that speaks like every mob

*** TODO intentional advancement design

*** DONE power a beacon with all mineral items

*** DONE Rage baiter
fish warden several times for his angry value go from 0 to 150

- zintux

*** DONE Conduel
Make conduit kill a mob

*** DONE Short circuit
:LOGBOOK:
CLOCK: [2026-03-07 Sat 00:11]--[2026-03-07 Sat 00:41] =>  0:30
:END:
get a breeze to activate 9 redstone components at the same time

*** DONE Double click on an empty slot [3/3]
[[https://discord.com/channels/419383460600348673/738946989726760980/1478859542505979944][Discord]]

**** DONE Check if this works on a server with ping
:LOGBOOK:
CLOCK: [2026-03-06 Fri 21:09]--[2026-03-06 Fri 21:21] =>  0:12
:END:

**** DONE Profile with spark
:LOGBOOK:
CLOCK: [2026-03-06 Fri 21:27]--[2026-03-06 Fri 21:37] =>  0:10
:END:

**** DONE Code it

*** DONE Receive a gift from a cat
from bedrock

*** DONE Receive every gift from a cat
from bedrock

*** DONE Do It For The Frame
Use a glass pane in a cartography table to lock a map, preventing it
from updating (name by terminxa, idea by pointy)

*** DONE When Pigs Fly
Use a saddle to ride a pig, and then have the pig get hurt from fall
damage while riding it.

*** DONE Disenchanted
Use a Grindstone to get experience from an enchanted item.

*** DONE Alternative Fuel
Power a furnace with a kelp block

*** DONE Super Fuel
Power a furnace with lava

*** DONE Beam Me Up
Teleport over 100 meters from a single throw of an Ender Pearl

*** DONE Plethora of Cats
Befriend twenty stray cats

*** DONE smelt leaves using a leaf litter to get leaf litter

*** DONE Leader of the Pack
Befriend five wolves.

*** DONE buy 1000 (or more) emerald from villagers

*** DONE Forged by Flesh
Retrieve an iron ingot from a defeated zombie. by DCMii

*** DONE Get Raid Of It
Drink milk to remove the Bad Omen effect; charlesMB

*** DONE Trash Bin
Throw an item into a cactus (Farming, after Spikey) by xMrPolx

*** DONE 10 end crystals respawn dragon

*** DONE Can you hear it from here?
ring a bell with a bow from ridiculous distance; name by
insertanicknamehere

*** DONE Be near sheep while evoker changes it color from blue to red

*** DONE Get all possible items from sus sand or gravel (it is hard)

*** DONE Fire Trick
Light a campfire and a candle by shooting an arrow at them (Building) by xMrPolx

*** DONE Maximum Coverage
Fully expand a map

*** DONE Paint it, red
Fill a map of 128x128 blocks with Red Concrete or Red Wool. by Iwer
Sonsch

*** DONE kill all mobs with anvil

** Other tasks

*** TODO Remove advancement 'get raid of it'
and delete any unneeded mixins or code related.

*** TODO Rename mixins to match new mappings
there are old names like ServerPlayerEntity from yarn mappings, before
i migrated to official mappings (just ServerPlayer). much more stuff,
im lazy for this.

*** TODO move this is not cookie clicker to FarmingTabGenerator
it is already in farming tab.

*** TODO Update from 1.21.5 to 1.21.11

**** DONE Update mod

**** TODO Add missing new mobs/items to advancements

** Suggestions
Some advancement suggestions im still considering...

*** Wikipedia
Read the power signal of every possible block that can be read using a
comparator. by xMrPolx

*** good luck killing this one - damage a villager with absorption
[[https://discord.com/channels/419383460600348673/738946989726760980/1474455422831427594][Discord]]

*** throw everything at cactus

*** Find a chest in an Ancient City with 4+ egapples

*** Find endtherite
Fully destroy main end island

*** collector of death messages

*** Kill the wither with an anvil :skull emoji:

*** Visit 128 strongholds (just visit)

*** Breed animals while they are in different dimensions
should be possible but doesn't work because of MC bug, same for
killing in different dimensions, etc

**** TODO research if its even possible to *do*

*** Enter a zombie village

*** Find a fossil

*** Find cactus tree in a trial chamber

*** Surface-to-air missile
kill a flying mob with a tnt launched by kb2 spear

*** It's not rocket science
die to a rocket while flying; by deleted reddit user

*** Pointy fishing
Pull a falling pointed dripstone with a fishing rod; by
insertanicknamehere

*** Scubaleton Horse Diver
Ride a skeleton horse on the ocean floor (Monsters) by xMrPolx

*** The Great Hunger
Survive a full day with your hunger bar completely emptied

*** Waypoint
write a coordinate to a structure in a book

*** all the colors of the rainbow - fill a map in rainbow colors
[[https://discord.com/channels/419383460600348673/1366124720306786406/1479586226221748415][Discord]]

*** AA%
Breed 10 animals, kill 15 hostile mobs, get a wither skeleton head,
spawn the wither, travel to a trial chamber, craft every stone tool,
respawn the dragon, travel to every nether biome, eat every food item,
craft a beacon, and get every effect (not at once) in the span of
10(?) minutes

[[https://discord.com/channels/419383460600348673/1366124720306786406/1479832295912509491][Discord]]

*** Revengeance
Get stung by a bee that has travelled more than 1 kilometer from its nest

D. E. T. E. C. T. A. B. L. E. (easily) (as explained [[https://discord.com/channels/419383460600348673/1366124720306786406/1479841304287645800][here]])

[[https://discord.com/channels/419383460600348673/738946989726760980/1417524911827714148][Discord]]

*** attempt to build aether portal

*** gifted power creaking pure effort player
deal over 10k damage to a creaking just for it to be unphased

by coolgirl

[[https://discord.com/channels/419383460600348673/1366124720306786406/1480240833335660720][Discord]]

*** play in every language for 15 minutes
maybe if i add this they'll stop suggesting it

*** Keeping the streets clean - defeat a pillager patrol party
[[https://discord.com/channels/419383460600348673/738946989726760980/1446201076733968529][Discord]]

*** What a Waste - Craft 2 full durability netherite hoes together
[[https://discord.com/channels/419383460600348673/738946989726760980/1446536255436226622][Discord]]

*** cancel raid omen by going to the nether

*** make ravager kill itself
[[https://discord.com/channels/419383460600348673/1441440209878122507/1442632231523979355][One of discord suggestions]]

*** GET DOWN MISTER PRESIDENT
[[https://discord.com/channels/419383460600348673/738946989726760980/1442360311448342658][Discord]]

*** Jump a 3 block long neo jump
[[https://discord.com/channels/419383460600348673/738946989726760980/1418419417494192209][Discord]]

*** break things with ub3
[[https://discord.com/channels/419383460600348673/738946989726760980/1416065579378413659][Discord]]

*** You wind, I win
Throw a wind charge to activate a dispenser that shoots you with a wind charge back

[[https://discord.com/channels/419383460600348673/738946989726760980/1411778195153490061][Discord]]

*** go back to your last death location and plant a wither rose
[[https://discord.com/channels/419383460600348673/738946989726760980/1365469401570345072][Discord]]

*** 4 chicken from thrown egg

*** Purgatory
create an infinite loop by feeding gold nuggets from a gold ingot autocrafter into another autocrafter that turns it back into ingots and then puts it back in the first

[[https://discord.com/channels/419383460600348673/738946989726760980/1164661056816300039][Discord]]

*** Airplane Mode - Send a chat message while falling
[[https://discord.com/channels/419383460600348673/738946989726760980/1130218532257406986][Discord]]

*** did you not recognize me? - let the piglin kill the zombified piglin
[[https://discord.com/channels/419383460600348673/738946989726760980/1128114176724848791][Discord]]

you have to get piglin to aggro on you and stand behing zombie piglin,
when piglin kills it the player its aggroed on gets the advancement

*** zombie break door.

*** Spain.
[[https://discord.com/channels/419383460600348673/738946989726760980/1001711104700981278][Discord]]

*** Were wolf
slay a wolf within 10 seconds of midnight on a full moon

[[https://discord.com/channels/419383460600348673/738946989726760980/900427605625421905][Discord]]

*** throw a wither in void

** Bad suggestions
Rejected suggestions. But funny, so might be added when run out of
ideas.

*** smelt every product

*** Try to lay on occupied bed
impossible in single player.

*** my shiza wakes up
Use a bow to activate a dispenser that will shoot an arrow that will
activate an autocrafter that will craft a bow
